Revit 2026 API

# CurtainGridGetMullionIds Method

---

Gets all ElementIds of the mullions of the curtain grid.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ICollection<ElementId> GetMullionIds()
```
```vb
Public Function GetMullionIds As ICollection(Of ElementId)
```
```cpp
public:
ICollection<ElementId^>^ GetMullionIds()
```
```fsharp
member GetMullionIds : unit -> ICollection<ElementId>
```

#### Return Value

ICollectionElementIdThe mullion ElementIds

ElementIds are of Mullion Elements.

#### Reference

CurtainGrid Class

Autodesk.Revit.DB Namespace